Revit 2027 API
RegenerationAttribute.Option Property
Regeneration option.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RegenerationOption Option { get; }
Public ReadOnly Property Option As RegenerationOption
	Get
public:
property RegenerationOption Option {
	RegenerationOption get ();
}
member Option : RegenerationOption with get
Property Value
RegenerationOption
See Also
Reference
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace